Tekla Open API Reference for Tekla Structures 2025
DetailMark.DetailMarkAttributes.DetailBoundaryShape Enumeration
 The boundary shapes of the detail mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DetailBoundaryShape
Public Enumeration DetailBoundaryShape
Members
Member name | Value | Description
None | 1 |  No shape.
Circular | 2 |  The circular shape.
Rectangular | 3 |  The rectangular shape.
See Also
Reference
Tekla.Structures.Drawing Namespace